module.exports.config = {
name: "autosent",
version: "10.02",
hasPermssion: 0,
credits: "𝗠𝗶𝘀𝗵𝗶",
description: "Set Karne Ke Bad Automatically Msg Send Karega",
commandCategory: "group messenger",
usages: "[]",
cooldowns: 3
};
const nam = [{
timer: "12:00:00 AM",
message: ['──── •💖🌿• ────\n𝐈𝐭𝐬 10:00:𝐀𝐌\nوَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ وَأَنَّ اللَّهَ تَوَّابٌ حَكِيمٌ\n\nاور اگر تم پر اللہ کا فضل اور اس کی رحمت نہ ہوتی (تو تم ایسے حالات میں زیادہ پریشان ہوتے) اور بیشک اللہ بڑا ہی توبہ قبول فرمانے والا بڑی حکمت والا ہے،\n──── •🌿💖• ────'] ,
},
{
timer: "1:00:00 AM",
message: ['──── •☘️•❤️ ────\n𝐈𝐭𝐬 11:00 𝐀𝐌\nإِنَّ الَّذِينَ يُحِبُّونَ أَنْ تَشِيعَ الْفَاحِشَةُ فِي الَّذِينَ آمَنُوا لَهُمْ عَذَابٌ أَلِيمٌ فِي الدُّنْيَا وَالْآخِرَةِ ۚ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ\n\nبیشک جو لوگ اس بات کو پسند کرتے ہیں کہ مسلمانوں میں بے حیائی پھیلے ان کے لئے دنیا اور آخرت میں دردناک عذاب ہے، اور اللہ (ایسے لوگوں کے عزائم کو) جانتا ہے اور تم نہیں جانتے\n──── •🌸💛• ────'] ,
},
{
timer: '2:00:00 AM',
message: ['──── •💙✨• ──── \n𝐈𝐭𝐬 12:00 𝐀𝐌 \nإِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَلَاسِلَ وَأَغْلَالًا وَسَعِيرًا\n\nبیشک ہم نے کافروں کے لئے (پاؤں کی) زنجیریں اور (گردن کے) طوق اور (دوزخ کی) دہکتی آگ تیار کر رکھی ہے،\n ──── •🧡💫• ────'] ,
},
{
timer: '3:00:00 AM',
message: ['──── •💫💜• ──── \n𝐈𝐭𝐬 1:00 𝐀𝐌\nوَاذْكُرِ اسْمَ رَبِّكَ بُكْرَةً وَأَصِيلًا\n\nاور صبح و شام اپنے رب کے نام کا ذکر کیا کریں،\n ──── •💜🌿• ────'] ,
},
{
timer: '4:00:00 AM',
message: ['──── •💙✨• ──── \n𝐈𝐭𝐬 2:00 𝐀𝐌\nإِنَّ هَٰذِهِ تَذْكِرَةٌ ۖ فَمَنْ شَاءَ اتَّخَذَ إِلَىٰ رَبِّهِ سَبِيلًا\n\nبے شک یہ (قرآن) نصیحت ہے، سو جو کوئی چاہے اپنے رب کی طرف (پہنچنے کا) راستہ اِختیار کر لے،\n ──── •💫🧡• ────']
},
{
timer: '5:00:00 AM',
message: ['──── •🌸🧡• ──── \n𝐈𝐭𝐬 3:00 𝐀𝐌\nوَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ ۚ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا\n\nاور تم خود کچھ نہیں چاہ سکتے سوائے اس کے جو اللہ چاہے، بے شک اللہ خوب جاننے والا بڑی حکمت والا ہے،\n ──── •🌿💛• ────']
},
{
timer: '6:00:00 AM',
message: ['──── •❤️•💫 ──── \n𝐈𝐭𝐬 4:00 𝐀𝐌\nهُوَ الَّذِي يُصَوِّرُكُمْ فِي الْأَرْحَامِ كَيْفَ يَشَاءُ ۚ لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيم\n\nوہی ہے جو (ماؤں کے) رحموں میں تمہاری صورتیں جس طرح چاہتا ہے بناتا ہے، اس کے سوا کوئی لائقِ پرستش نہیں (وہ) بڑا غالب بڑی حکمت والا ہے،\n\n😇😊\n──── •☘️•💖 ────']
},
{
timer: '7:00:00 AM',
message: ['──── •🌸💫• ──── \n𝐈𝐭𝐬 5:00 𝐀𝐌\nإِنَّ الَّذِينَ كَفَرُوا لَنْ تُغْنِيَ عَنْهُمْ أَمْوَالُهُمْ وَلَا أَوْلَادُهُمْ مِنَ اللَّهِ شَيْئًا ۖ وَأُولَٰئِكَ هُمْ وَقُودُ النَّارِ\n\nبیشک جنہوں نے کفر کیا نہ ان کے مال انہیں اﷲ (کے عذاب) سے کچھ بھی بچا سکیں گے اور نہ ان کی اولاد، اور وہی لوگ دوزخ کا ایندھن ہیں،\n ──── •💔🌿• ────']
},
{
timer: '8:00:00 AM',
message: ['──── •💜🍃• ──── \n𝐈𝐭𝐬 6:00 𝐀𝐌\nكَدَأْبِ آلِ فِرْعَوْنَ وَالَّذِينَ مِنْ قَبْلِهِمْ ۚ كَذَّبُوا بِآيَاتِنَا فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ ۗ وَاللَّهُ شَدِيدُ الْعِقَابِ\n\n(ان کا بھی) قومِ فرعون اور ان سے پہلی قوموں جیسا طریقہ ہے، جنہوں نے ہماری آیتوں کو جھٹلایا تو اﷲ نے ان کے گناہوں کے باعث انہیں پکڑ لیا، اور اﷲ سخت عذاب دینے والا ہے،\n──── •⭐✨• ────']
},
{
timer: '9:00:00 AM',
message: ['──── •💫🌿• ────\n𝐈𝐭𝐬 7:00 𝐀𝐌\nقُلْ لِلَّذِينَ كَفَرُوا سَتُغْلَبُونَ وَتُحْشَرُونَ إِلَىٰ جَهَنَّمَ ۚ وَبِئْسَ الْمِهَادُ\n\nکافروں سے فرما دیں: تم عنقریب مغلوب ہو جاؤ گے اور جہنم کی طرف ہانکے جاؤ گے، اور وہ بہت ہی برا ٹھکانا ہے،\n──── •💛⭐• ────']
},
{
timer: '10:00:00 AM',
message: ['──── •☘️•💛 ────\n𝐈𝐭𝐬 8:00 𝐀𝐌\nقُلْ إِنْ تُخْفُوا مَا فِي صُدُورِكُمْ أَوْ تُبْدُوهُ يَعْلَمْهُ اللَّهُ ۗ وَيَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ\n\nآپ فرما دیں کہ جو تمہارے سینوں میں ہے خواہ تم اسے چھپاؤ یا اسے ظاہر کر دو اﷲ اسے جانتا ہے، اور جو کچھ آسمانوں اور زمین میں ہے وہ خوب جانتا ہے، اور اﷲ ہر چیز پر بڑا قادر ہے،\n──── •💜⭐• ────']
},
{
timer: '11:00:00 AM',
message: ['──── •✨🌸• ────\n𝐈𝐭𝐬 9:00 𝐀𝐌\nوَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ ۖ وَلَئِنْ كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيدٌ\n\nاور (یاد کرو) جب تمہارے رب نے آگاہ فرمایا کہ اگر تم شکر ادا کرو گے تو میں تم پر (نعمتوں میں) ضرور اضافہ کروں گا اور اگر تم ناشکری کرو گے تو میرا عذاب یقیناً سخت ہے،\n──── •🍃💙• ────']
},
{
timer: '12:00:00 PM',
message: ['──── •💔💫• ────\n𝐈𝐭𝐬 10:00 𝐀𝐌\nالَّذِي أَحْسَنَ كُلَّ شَيْءٍ خَلَقَهُ ۖ وَبَدَأَ خَلْقَ الْإِنْسَانِ مِنْ طِينٍ\n\nوہی ہے جس نے خوبی و حسن بخشا ہر اس چیز کو جسے اس نے پیدا فرمایا اور اس نے انسانی تخلیق کی ابتداء مٹی (یعنی غیر نامی مادّہ) سے کی،\n──── •☘️•💛 ────']
},
{
timer: '01:00:00 PM',
message: ['──── •💜⭐• ────\n𝐈𝐭𝐬 11:00 𝐀𝐌\nاتَّبِعُوا مَنْ لَا يَسْأَلُكُمْ أَجْرًا وَهُمْ مُهْتَدُونَ\n\nایسے لوگوں کی پیروی کرو جو تم سے کوئی معاوضہ نہیں مانگتے اور وہ ہدایت یافتہ ہیں،\n──── •⭐🌿• ────']
},
{
timer: '2:00:00 PM',
message: ['──── •✨☘️• ────\n𝐈𝐭𝐬 12:00 𝐏𝐌\nوَآيَةٌ لَهُمُ الْأَرْضُ الْمَيْتَةُ أَحْيَيْنَاهَا وَأَخْرَجْنَا مِنْهَا حَبًّا فَمِنْهُ يَأْكُلُونَ\n\nاور اُن کے لئے ایک نشانی مُردہ زمین ہے، جِسے ہم نے زندہ کیا اور ہم نے اس سے (اناج کے) دانے نکالے، پھر وہ اس میں سے کھاتے ہیں،\n──── •💙✨• ────']
},
{
timer: '3:00:00 PM',
message: ['──── •⭐💙• ────\n𝐈𝐭𝐬 1:00 𝐏𝐌\nوَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَهَا ۚ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ\n\nاور سورج ہمیشہ اپنی مقررہ منزل کے لئے (بغیر رکے) چلتا رہتا، ہے یہ بڑے غالب بہت علم والے (رب) کی تقدیر ہے،\n──── •💛💫• ────']
},
{
timer: '4:00:00 PM',
message: ['──── •🌸🧡• ────\n𝐈𝐭𝐬 2:00 𝐏𝐌\nوَنُفِخَ فِي الصُّورِ فَإِذَا هُمْ مِنَ الْأَجْدَاثِ إِلَىٰ رَبِّهِمْ يَنْسِلُونَ\n\nاور (جس وقت دوبارہ) صُور پھونکا جائے گا تو وہ فوراً قبروں سے نکل کر اپنے رب کی طرف دوڑ پڑیں گے،\n──── •⭐✨• ────']
},
{
timer: '5:00:00 PM',
message: ['──── •🧡💫• ────\n𝐈𝐭𝐬 3:00 𝐏𝐌\nتُولِجُ اللَّيْلَ فِي النَّهَارِ وَتُولِجُ النَّهَارَ فِي اللَّيْلِ ۖ وَتُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ ۖ وَتَرْزُقُ مَنْ تَشَاءُ بِغَيْرِ حِسَابٍ\n\nتو ہی رات کو دن میں داخل کرتا ہے اور دن کو رات میں داخل کرتا ہے اور تُو ہی زندہ کو مُردہ سے نکالتا ہے اورمُردہ کو زندہ سے نکالتا ہے اور جسے چاہتا ہے بغیر حساب کے (اپنی نوازشات سے) بہرہ اندوز کرتا ہے،\n──── •💜🌿• ────']
},
{
timer: '6:00:00 PM',
message: ['──── •🌸🧡• ────\n𝐈𝐭𝐬 4:00 𝐏𝐌\nقُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَاللَّهُ غَفُورٌ رَحِيمٌ\n\n(اے حبیب!) آپ فرما دیں: اگر تم اﷲ سے محبت کرتے ہو تو میری پیروی کرو تب اﷲ تمہیں (اپنا) محبوب بنا لے گا اور تمہارے لئے تمہارے گناہ معاف فرما دے گا، اور اﷲ نہایت بخشنے والا مہربان ہے،\n ──── •💙💫• ────']
},
{
timer: '7:00:00 PM',
message: ['──── •💖🌿• ────\n𝐈𝐭𝐬 5:00 𝐏𝐌\nقُلْ أَطِيعُوا اللَّهَ وَالرَّسُولَ ۖ فَإِنْ تَوَلَّوْا فَإِنَّ اللَّهَ لَا يُحِبُّ الْكَافِرِينَ\n\nآپ فرما دیں کہ اﷲ اور رسول (صلی اللہ علیہ وآلہ وسلم) کی اطاعت کرو پھر اگر وہ روگردانی کریں تو اﷲ کافروں کو پسند نہیں کرتا،\n──── •✨🌸• ────']
},
{
timer: '8:00:00 PM',
message: ['──── •💛🌸• ────\n𝐈𝐭𝐬 6:00 𝐏𝐌\nإِنَّ اللَّهَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ ۗ هَٰذَا صِرَاطٌ مُسْتَقِيمٌ\n\nبیشک اﷲ میرا رب ہے اور تمہارا بھی (وہی) رب ہے پس اسی کی عبادت کرو، یہی سیدھا راستہ ہے،\n──── •☘️•💙 ────']
},
{
timer: '9:00:00 PM',
message: ['──── •🌸💔• ────\n𝐈𝐭𝐬 7:00 𝐏𝐌\nرَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ\n\nاے ہمارے رب! ہم اس کتاب پر ایمان لائے جو تو نے نازل فرمائی اور ہم نے اس رسول کی اتباع کی سو ہمیں (حق کی) گواہی دینے والوں کے ساتھ لکھ لے،\n──── •⭐🌿• ────']
},
{
timer: '10:00:00 PM',
message: ['──── •💖⭐• ────\n𝐈𝐭𝐬 8:00 𝐏𝐌\nفَأَمَّا الَّذِينَ كَفَرُوا فَأُعَذِّبُهُمْ عَذَابًا شَدِيدًا فِي الدُّنْيَا وَالْآخِرَةِ وَمَا لَهُمْ مِنْ نَاصِرِينَ\n\nپھر جو لوگ کافر ہوئے انہیں دنیا اور آخرت (دونوں میں) سخت عذاب دوں گا اور ان کا کوئی مددگار نہ ہو گا،\n──── •☘️•💙 ────']
},
{
timer: '11:00:00 PM',
message: ['──── •💔🌿• ────\n𝐈𝐭𝐬 9:00 𝐏𝐌\nوَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُوَفِّيهِمْ أُجُورَهُمْ ۗ وَاللَّهُ لَا يُحِبُّ الظَّالِمِينَ\n\nاور جو لوگ ایمان لائے اور انہوں نے نیک عمل کئے تو (اﷲ) انہیں ان کا بھرپور اجر دے گا، اور اﷲ ظالموں کو پسند نہیں کرتا،\n──── •❤️🌸• ────']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
