module.exports.config = {
    name: "Mohabbat",
    version: "1.0.0",
    hasPermision: 0,
    credit: "liones",
    description: "random quran verse",
    commandCategory: "random-img",
    cooldowns: 0,
};
module.exports.run = async function({api, event, args, utils, Users, Threads}) {
  const axios = require("axios")
  const request = require("request")
  const fs = require("fs-extra")
  var link = ["https://i.imgur.com/A38KNq8.jpg", "https://i.imgur.com/vCEuGj5.jpg", "https://i.imgur.com/To4bQ3Z.jpg", "https://i.imgur.com/GaaRbly.jpg", "https://i.imgur.com/Xzm3xt3.jpg", "https://i.imgur.com/B31NNFz.jpg", "https://i.imgur.com/BjlP0vs.jpg", "https://i.imgur.com/pXEtBmQ.jpg", "https://i.imgur.com/oA9dGHB.jpg", "https://i.imgur.com/cijDvCq.jpg", "https://i.imgur.com/IoRbe9V.jpg", "https://i.imgur.com/cBJESIS.jpg", "https://i.imgur.com/hBQCI9G.jpg", "https://i.imgur.com/cuuvaFq.jpg", "https://i.imgur.com/uVFVcmb.jpg", "https://i.imgur.com/fNoad50.jpg", "https://i.imgur.com/zwpJyZ7.jpg", "https://i.imgur.com/dYLErLW.jpg", "https://i.imgur.com/D775r4L.jpg", "https://i.imgur.com/o9vWXIW.jpg"];
var amir = [`𝙝𝙪𝙢 𝙠𝙤 𝙠𝙝𝙪𝙨𝙝𝙞 𝙢𝙞𝙡𝙞 𝙗𝙝𝙞 𝙩𝙤 𝙠𝙖𝙝𝙖𝙣 𝙧𝙖𝙠𝙝𝙚𝙞𝙣 𝙜𝙮 𝙝𝙪𝙢 𝙖𝙣𝙠𝙝𝙤𝙣 𝙢𝙚𝙞𝙣 𝙝𝙖𝙨𝙧𝙖𝙩𝙚𝙞𝙣 𝙝𝙖𝙞𝙣 𝙤𝙧 𝙙𝙞𝙡 𝙢𝙚𝙞𝙣 𝙠𝙚𝙨𝙞 𝙠𝙖 𝙜𝙪𝙢.                                     \n𝗖𝗼𝗱𝗲𝗱 𝗯𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜. 𝗫❤️` ,`𝙟𝙤 𝙙𝙞𝙡 𝙠 𝙖𝙖𝙞𝙣𝙚 𝙢𝙚𝙞𝙣 𝙝𝙤 𝙬𝙤𝙝𝙞 𝙝𝙖𝙞 𝙥𝙮𝙖𝙧 𝙠 𝙦𝙖𝙗𝙞𝙡 \n  \n𝙬𝙧𝙣𝙖 𝙙𝙚𝙚𝙬𝙖𝙧 𝙠 𝙦𝙖𝙗𝙞𝙡 𝙩𝙤 𝙝𝙖𝙧 𝙩𝙖𝙨𝙬𝙚𝙚𝙧 𝙝𝙤𝙩𝙞 𝙝𝙖𝙞 ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗯𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`,`𝙚𝙠 𝙢𝙪𝙨𝙠𝙖𝙣 𝙩𝙪 𝙢𝙪𝙝𝙟𝙚 𝙚𝙠 𝙗𝙖𝙖𝙧 𝙙𝙚 𝙙𝙚\n \n𝙠𝙝𝙬𝙖𝙗 𝙢𝙚𝙞𝙣 𝙝𝙞 𝙨𝙖𝙝𝙞 𝙚𝙠 𝙙𝙚𝙚𝙙𝙖𝙧 𝙙𝙚 𝙙𝙚\n \n𝙗𝙖𝙨 𝙚𝙠 𝙗𝙖𝙖𝙧 𝙠𝙖𝙧 𝙡𝙚 𝙩𝙪 𝙖𝙖𝙣𝙚 𝙠𝙖 𝙬𝙖𝙙𝙖\n \n𝙥𝙝𝙞𝙧 𝙪𝙢𝙖𝙧 𝙗𝙝𝙖𝙧 𝙠𝙖 𝙘𝙝𝙖𝙝𝙚 𝙞𝙣𝙩𝙚𝙯𝙖𝙧 𝙙𝙚 𝙙𝙚  ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️` ,`𝙞𝙩𝙣𝙖 𝙗𝙝𝙞 𝙜𝙪𝙢𝙖𝙖𝙣 𝙣𝙖 𝙠𝙖𝙧 𝙖𝙥𝙣𝙞 𝙟𝙚𝙚𝙩 𝙥𝙖𝙧 𝙖𝙚 𝙗𝙚𝙠𝙝𝙖𝙗𝙖𝙧\n \n𝙨𝙝𝙚𝙝𝙚𝙧 𝙢𝙚𝙞𝙣 𝙩𝙚𝙧𝙞 𝙟𝙚𝙚𝙩 𝙨𝙚 𝙯𝙮𝙖𝙙𝙖 𝙘𝙝𝙖𝙧𝙘𝙝𝙚 𝙩𝙤 𝙢𝙚𝙧𝙞 𝙝𝙖𝙖𝙧 𝙠𝙚 𝙝𝙖𝙞𝙣  ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️` ,`𝙖𝙥𝙣𝙮 𝙗𝙪𝙨𝙨 𝙢𝙖𝙞𝙣 𝙠𝙖𝙧 𝙡𝙖𝙞𝙩𝙮 𝙝𝙤 𝙪𝙛𝙛 𝙠𝙞𝙩𝙣𝙖 𝙗𝙚-𝙗𝙪𝙨 𝙠𝙖𝙧 𝙙𝙖𝙞𝙩𝙮 𝙝𝙤'\n \n'𝙖𝙗𝙝𝙞 𝙩𝙪𝙠 𝙮𝙖𝙖𝙙 𝙠𝙚𝙧 𝙧𝙖𝙝𝙖𝙮 𝙝𝙤 𝙥𝙖𝙜𝙖𝙡 𝙝𝙤 𝙩𝙪𝙢 𝙦𝙖𝙨𝙖𝙢 𝙨𝙚 \n \n𝙪𝙨 𝙣𝙚 𝙩𝙪 𝙩𝙚𝙧𝙖𝙮 𝙗𝙖𝙖𝙙 𝙗𝙝𝙞 𝙝𝙖𝙯𝙖𝙧𝙤𝙤𝙣 𝙗𝙝𝙪𝙡𝙖 𝙙𝙞𝙮𝙖𝙮 ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`,`𝙡𝙖𝙛𝙯𝙤𝙣 𝙠𝙞 𝙩𝙖𝙧𝙖𝙝 𝙢𝙪𝙟𝙨𝙚 𝙠𝙞𝙩𝙖𝙗𝙤𝙣 𝙢𝙚 𝙢𝙞𝙡𝙖 𝙠𝙖𝙧\n \n𝙙𝙪𝙣𝙞𝙮𝙖 𝙠𝙖 𝙖𝙜𝙖𝙧 𝙙𝙖𝙧 𝙝𝙖𝙞 𝙩𝙤 𝙠𝙝𝙬𝙖𝙙𝙤 𝙢𝙚 𝙢𝙞𝙡𝙖 𝙠𝙖𝙧\n \n𝙥𝙝𝙤𝙡𝙤𝙣 𝙠𝙖 𝙠𝙝𝙪𝙨𝙝𝙗𝙤 𝙨𝙚 𝙩𝙖𝙡𝙪𝙦 𝙝𝙖 𝙯𝙖𝙧𝙤𝙧𝙞 𝙩𝙤 𝙗𝙖𝙣 𝙠𝙚 𝙢𝙚𝙝𝙖𝙦\n \n𝙢𝙪𝙟𝙝𝙨𝙚 𝙜𝙪𝙡𝙖𝙗𝙤 𝙢𝙚 𝙢𝙞𝙡𝙖 𝙠𝙖𝙧 ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`,`𝙢𝙚𝙧𝙚 𝙬𝙖𝙟𝙤𝙤𝙙 𝙢𝙚𝙞𝙣 𝙬𝙖𝙛𝙖𝙖 𝙠𝙞 𝙧𝙤𝙨𝙝𝙣𝙞 𝙪𝙩𝙖𝙖𝙧 𝙙𝙚\n \n 𝙥𝙝𝙞𝙧 𝙞𝙩𝙣𝙖 𝙥𝙮𝙖𝙧 𝙙𝙚 𝙠𝙚 𝙢𝙪𝙟𝙝𝙚 𝙘𝙝𝙖𝙝𝙖𝙩𝙤𝙣 𝙨𝙚 𝙢𝙖𝙖𝙧 𝙙𝙚\n \n𝙗𝙤𝙝𝙖𝙩 𝙪𝙙𝙖𝙖𝙨 𝙝𝙤𝙤𝙣 𝙨𝙤 𝙢𝙖𝙞𝙣 𝙩𝙚𝙧𝙚 𝙥𝙖𝙖𝙨 𝙖𝙖 𝙜𝙖𝙮𝙖\n \n𝙠𝙪𝙘𝙝 𝙖𝙞𝙨𝙞 𝙗𝙖𝙖𝙩 𝙠𝙚𝙧 𝙟𝙤 𝙙𝙞𝙡 𝙠𝙤 𝙘𝙝𝙖𝙞𝙣 𝙤 𝙠𝙖𝙧𝙖𝙖𝙧 𝙙𝙚\𝙣 \n𝙨𝙪𝙣𝙖 𝙝𝙖𝙞 𝙩𝙚𝙧𝙞 𝙚𝙠 𝙣𝙖𝙯𝙖𝙧 𝙨𝙖𝙣𝙬𝙖𝙧𝙩𝙞 𝙝𝙖𝙞 𝙯𝙞𝙣𝙙𝙖𝙜𝙞\n \n 𝙟𝙤 𝙝𝙤 𝙨𝙖𝙠𝙚 𝙩𝙤 𝙖𝙖𝙟 𝙢𝙚𝙧𝙞 𝙯𝙞𝙣𝙙𝙖𝙜𝙞 𝙨𝙖𝙣𝙬𝙖𝙧 𝙙𝙚 ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`,`𝙗𝙖𝙣 𝙜𝙖𝙮𝙞 𝙝𝙖𝙞 𝙙𝙞𝙡 𝙠 𝙢𝙖𝙟𝙗𝙤𝙧𝙞 𝙢𝙪𝙡𝙖𝙠𝙖𝙩𝙖𝙞𝙣\n \n𝙝𝙤 𝙜𝙖𝙮𝙞 𝙝𝙖𝙞 𝙖𝙗 𝙩𝙪 𝙯𝙧𝙤𝙧𝙞 𝙢𝙪𝙡𝙖𝙠𝙖𝙩𝙖𝙞𝙣\n \n𝙖𝙖𝙣𝙠𝙝𝙤𝙣 𝙨𝙚 𝙠𝙪𝙘𝙝 𝙠𝙚𝙝 𝙠 𝙗𝙞𝙘𝙝𝙖𝙧 𝙟𝙖𝙣𝙖 𝙟𝙖𝙣 𝙡𝙚 𝙡𝙖𝙞𝙣 𝙜𝙞 𝙮𝙚 𝙖𝙙𝙝𝙤𝙤𝙧𝙞 𝙢𝙪𝙡𝙖𝙠𝙖𝙩𝙖𝙞𝙣 ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`,`𝙦𝙖𝙮𝙖𝙢𝙖𝙩 𝙩𝙖𝙠 𝙩𝙪𝙟𝙝𝙚 𝙮𝙖𝙖𝙙 𝙠𝙖𝙧𝙚𝙣𝙜𝙚\n \n𝙩𝙚𝙧𝙞 𝙝𝙖𝙧 𝙗𝙖𝙖𝙩 𝙥𝙖𝙧 𝙖𝙞𝙩𝙗𝙖𝙖𝙧 𝙠𝙖𝙧𝙚𝙣𝙜𝙚\n \n𝙩𝙪𝙟𝙝𝙚 𝙖𝙣𝙖𝙮 𝙠𝙖 𝙩𝙤 𝙣𝙖𝙝𝙞 𝙠𝙖𝙝𝙚𝙣𝙜𝙚\n \n𝙥𝙖𝙧 𝙥𝙝𝙞𝙧 𝙗𝙝𝙞 𝙩𝙚𝙧𝙚 𝙖𝙣𝙖𝙮 𝙠𝙖 𝙞𝙣𝙩𝙚𝙯𝙖𝙧 𝙠𝙖𝙧𝙚𝙣𝙜𝙚. ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`,`𝙢𝙖𝙨𝙤𝙤𝙢 𝙢𝙤𝙝𝙗𝙗𝙖𝙩 𝙠𝙖 𝙞𝙩𝙣𝙖 𝙨𝙖 𝙛𝙖𝙨𝙖𝙣𝙖 𝙝𝙖\n \n𝙠𝙖𝙜𝙝𝙖𝙯 𝙠𝙞 𝙝𝙖𝙬𝙚𝙡𝙮 𝙝𝙖 𝙖𝙪𝙧 𝙗𝙖𝙧𝙞𝙨𝙝 𝙠𝙤 𝙗𝙝𝙞 𝙖𝙣𝙖 𝙝𝙖\n \n𝙠𝙮𝙖 𝙨𝙝𝙧𝙩𝙮 𝙢𝙪𝙝𝙗𝙗𝙖𝙩 𝙝𝙖 𝙠𝙮𝙖 𝙨𝙝𝙖𝙧𝙩𝙮 𝙯𝙖𝙢𝙖𝙣𝙖 𝙝𝙖\n \n𝙖𝙖𝙬𝙖𝙯 𝙗𝙝𝙚 𝙯𝙖𝙠𝙝𝙢𝙚 𝙝𝙖 𝙖𝙪𝙧 𝙜𝙚𝙚𝙩 𝙗𝙝𝙚 𝙜𝙖𝙣𝙖 𝙝𝙖\n \n𝙮𝙚 𝙞𝙨𝙝𝙖𝙦 𝙣𝙖𝙝𝙚 𝙖𝙖𝙨𝙖𝙖𝙣 𝙗𝙪𝙨 𝙞𝙩𝙣𝙖 𝙨𝙖𝙢𝙖𝙟𝙝 𝙡𝙚𝙟𝙮𝙚\n \n𝙞𝙠 𝙖𝙜𝙜 𝙠𝙖 𝙙𝙖𝙧𝙮𝙖 𝙝𝙖 𝙖𝙪𝙧 𝙙𝙤𝙤𝙗 𝙠 𝙟𝙖𝙣𝙖 𝙝𝙖 ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`,`𝙪𝙣𝙨𝙚 𝙥𝙮𝙖𝙧 𝙝𝙖𝙞 𝙥𝙖𝙧 𝙠𝙖𝙝𝙚 𝙗𝙝𝙞 𝙩𝙤𝙝 𝙠𝙖𝙞𝙨𝙚\n \n𝙮𝙚 𝙞𝙣𝙩𝙚𝙯𝙖𝙧 𝙝𝙪𝙢 𝙙𝙞𝙡 𝙠𝙖 𝙨𝙖𝙝𝙚 𝙗𝙝𝙞 𝙩𝙤𝙝 𝙠𝙖𝙞𝙨𝙚\n \n𝙥𝙮𝙖𝙧 𝙠𝙞 𝙜𝙖𝙡𝙞𝙮𝙤𝙣 𝙢𝙚𝙞𝙣 𝙣𝙖 𝙝𝙖𝙖𝙧 𝙝𝙖𝙞 𝙣𝙖 𝙟𝙚𝙚𝙩\n \n𝙙𝙞𝙡 𝙠𝙞 𝙠𝙖𝙨𝙝𝙢𝙖𝙠𝙖𝙨𝙝 𝙠𝙖 𝙠𝙪𝙘𝙝 𝙖𝙞𝙨𝙖 𝙝𝙖𝙞 𝙨𝙖𝙣𝙜𝙚𝙚𝙩. ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`,`𝙠𝙚𝙝𝙩𝙮 𝙝𝙖𝙞𝙣 𝙩𝙪𝙟𝙝 𝙠𝙤 𝙡𝙤𝙜 𝙢𝙖𝙨𝙚𝙚𝙝𝙖\n \n𝙢𝙖𝙜𝙖𝙧 𝙮𝙖𝙝𝙖𝙣 𝙞𝙠 𝙨𝙝𝙖𝙠𝙝𝙨 𝙢𝙖𝙧 𝙝𝙞 𝙜𝙖𝙮𝙖 𝙝𝙖𝙞\n \n𝙩𝙪𝙟𝙝𝙮 𝙙𝙚𝙠𝙝𝙣𝙮 𝙠 𝙗𝙖𝙖𝙙 ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`,`𝙪𝙡𝙟𝙝𝙖 𝙧𝙖𝙝𝙞 𝙝𝙖𝙞 𝙢𝙪𝙟𝙝 𝙠𝙤\n \n𝙮𝙚𝙝𝙞 𝙠𝙖𝙨𝙝 𝙢𝙖𝙠𝙖𝙨𝙝 𝙢𝙪𝙨𝙖𝙡𝙨𝙖𝙡\n \n𝙬𝙤 𝙖𝙖 𝙗𝙖𝙨𝙖 𝙝𝙖𝙞 𝙢𝙪𝙟𝙝 𝙢𝙚𝙞\n \n𝙮𝙖 𝙢𝙖𝙞 𝙪𝙨 𝙢𝙚𝙞 𝙠𝙝𝙤 𝙜𝙞𝙖 𝙝𝙤𝙤 ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`,`𝙢𝙪𝙟𝙝𝙮 𝙦𝙪𝙗𝙤𝙤𝙡 𝙝𝙖𝙞 𝙝𝙚𝙧 𝙙𝙖𝙧𝙙\n \n𝙝𝙚𝙧 𝙩𝙖𝙠𝙡𝙚𝙚𝙛 𝙩𝙚𝙧𝙞 𝙘𝙝𝙖𝙝𝙖𝙩 𝙢𝙚\n \n𝙗𝙖𝙨 𝙞𝙩𝙣𝙖 𝙗𝙖𝙩𝙖 𝙙𝙚 𝙠𝙞𝙮𝙖 𝙩𝙪𝙟𝙝𝙮 𝙢𝙚𝙧𝙞 𝙢𝙤𝙝𝙖𝙗𝙗𝙖𝙩 𝙦𝙪𝙗𝙤𝙤𝙡 𝙝𝙖𝙞..? ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`,`𝙗𝙤𝙝𝙖𝙩 𝙨𝙖𝙛𝙛𝙖𝙖𝙠 𝙝𝙤 𝙩𝙪𝙢 𝙗𝙝𝙞..\n \n𝙢𝙤𝙝𝙖𝙗𝙗𝙖𝙩 𝙖𝙞𝙨𝙚 𝙠𝙚𝙧𝙩𝙮 𝙝𝙤,,\n \n𝙠 𝙟𝙚𝙨𝙚 𝙜𝙝𝙖𝙧 𝙠 𝙥𝙞𝙣𝙟𝙧𝙖𝙮 𝙢𝙚,\n \n𝙥𝙖𝙧𝙞𝙣𝙙𝙖 𝙥𝙖𝙖𝙡 𝙧𝙖𝙠𝙝𝙖 𝙝𝙤..! ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`,`𝙗𝙤𝙝𝙖𝙩 𝙨𝙖𝙛𝙛𝙖𝙖𝙠 𝙝𝙤 𝙩𝙪𝙢 𝙗𝙝𝙞..\n \n𝙢𝙤𝙝𝙖𝙗𝙗𝙖𝙩 𝙖𝙞𝙨𝙚 𝙠𝙚𝙧𝙩𝙮 𝙝𝙤,,\n \n𝙠 𝙟𝙚𝙨𝙚 𝙜𝙝𝙖𝙧 𝙠 𝙥𝙞𝙣𝙟𝙧𝙖𝙮 𝙢𝙚,\n \n𝙥𝙖𝙧𝙞𝙣𝙙𝙖 𝙥𝙖𝙖𝙡 𝙧𝙖𝙠𝙝𝙖 𝙝𝙤..!.. ۔  

\n𝗖𝗼𝗱𝗲𝗱 𝗕𝘆:\n❤️𝗦𝗛𝗘𝗥𝗡𝗜.𝗫❤️`];
  var juswa1 = amir[Math.floor(Math.random() * amir.length)];
  var callback = () => api.sendMessage({body:`${juswa1}`,attachment: fs.createReadStream(__dirname + "/cache/zac.jpg")}, event.threadID, () => fs.unlinkSync(__dirname + "/cache/zac.jpg")); 
      return request(encodeURI(link[Math.floor(Math.random() * link.length)])).pipe(fs.createWriteStream(__dirname+"/cache/zac.jpg")).on("close",() => callback());
   };
